## 1. Write a Pandas program to get the powers of an array values element-wise.
### SOLUTION :

In [38]:
import pandas as pd
import numpy as np
d = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
d_f = pd.DataFrame(d)
print(d_f)
print(np.power(d_f,2))

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83
      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

## 2. Write a Pandas program to create and display a DataFrame from a specified dictionary            data which has the index labels.
### SOLUTION :

In [56]:
import pandas as pd
import numpy as np
exam_data = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
            'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},
            index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
print(exam_data)
exam_data = exam_data[['attempts','name','qualify','score']]
print('\n',exam_data)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

    attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

## 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
### SOLUTION :

In [40]:
exam_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
attempts    10 non-null int64
name        10 non-null object
qualify     10 non-null object
score       8 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

## 4. Write a Pandas program to get the first 3 rows of a given DataFrame.
### SOLUTION :

In [41]:
exam_data.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

## 5. Write a Pandas program to select the 'name' and 'score' columns from the following                DataFrame.
### SOLUTION :

In [12]:
exam_data[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

## 6. Write a Pandas program to select the specified columns and rows from a given data.
### SOLUTION :

In [42]:
exam_data.iloc[[1,3,5,6],[1,3]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

## 7. Write a Pandas program to select the rows where the number of attempts in the                        examination is greater than 2.
### SOLUTION :

In [17]:
exam_data[exam_data['attempts']>2]

   attempts     name qualify  score
b         3     Dima      no    9.0
d         3    James      no    NaN
f         3  Michael     yes   20.0

## 8. Write a Pandas program to count the number of rows and columns of a DataFrame.
### SoLUTION :

In [43]:
print("Number of Rows : ",len(exam_data.axes[0]))
print("Number of Columns : ",len(exam_data.axes[1]))

Number of Rows :  10
Number of Columns :  4

## 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.
### SOLUTION :

In [21]:
exam_data[exam_data['score'].isnull()]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

## 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
### SOLUTION :

In [44]:
exam_data[exam_data['score'].between(15,20)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

## 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
### SOLUTION :

In [45]:
exam_data[(exam_data['attempts']<=2) & (exam_data['score']>15)]

   attempts       name qualify  score
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0

## 12. Write a Pandas program to change the score in row 'd' to 11.5.
### SOLUTION :

In [46]:
exam_data.loc['d','score']= 11.5
exam_data

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

## 13. Write a Pandas program to calculate the sum of the examination attempts by the students.
### SOLUTION :

In [31]:
exam_data['attempts'].sum()

19

## 14. Write a Pandas program to calculate the mean score for each different student in DataFrame. Sample Python dictionary data and list labels:
### SOLUTION :

In [32]:
exam_data['score'].mean()

13.333333333333334

## 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.
### SOLUTION :

In [47]:
import pandas as pd
exam_data.loc['k'] = [1,'Suresh','yes',15.5]
print(exam_data,'\n')
exam_data.drop('k')

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0
k         1     Suresh     yes   15.5

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no   11.5
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

##  16. Write a Pandas program to sort the DataFrame first by 'name' in descending order,   then by 'score' in ascending order.
### SOLUTION :

In [48]:
exam_data.sort_values(by=['name', 'score'], ascending=[False, True])

   attempts       name qualify  score
k         1     Suresh     yes   15.5
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
c         2  Katherine     yes   16.5
j         1      Jonas     yes   19.0
d         3      James      no   11.5
e         2      Emily      no    9.0
b         3       Dima      no    9.0
a         1  Anastasia     yes   12.5

## 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.
### SOLUTION :

In [58]:
print(exam_data, '\n')
exam_data.replace(['yes','no'],['True','False'])

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

   attempts       name qualify  score
a         1  Anastasia    True   12.5
b         3       Dima   False    9.0
c         2  Katherine    True   16.5
d         3      James   False    NaN
e         2      Emily   False    9.0
f         3    Michael    True   20.0
g         1    Matthew    True   14.5
h         1      Laura   False    NaN
i         2      Kevin   False    8.0
j         1      Jonas    True   19.0